import React from 'react';
import { useTranslation } from '../../src/common/i18n';
import { Head } from '../../src/common/Head';
import { Legal } from '../../src/common/Legal';

const getPrivacyPolicy = ({
  companyName,
  registryNumber,
  taxNumber,
  companyAddress,
  slug,
  customDomain,
}) => {
  return `
Со Политикатата на приватност, ќе ви појасниме каде и како се чуваат личните податоци на сите регистрирани купувачи на нашата интернет страна. Оваа политика на приватност се однесува само за ${slug}.la.mk, ${
    customDomain ?? ''
  } и поддомените. Доколку е присутен линк кој ќе Ве поврзе со други страни, ние не превземаме никаква одговорност во однос на заштитата на личните податоци која ја обезбедуваат тие интернет страни. 

Секој корисник при регистрација и купување, изјавува дека е запознаен и се согласува со нашата Политика на приватност. 

Доколку се регистрирате, сите лични податоци кои ќе ги внесете преку формата за регистрација, ќе се користат за потребите за достава на производот, реализација на плаќањето, како и за рекламирање на производи и услуги обезбедени од наша страна, доколку ја имате избрано оваа опција, а се чуваат согласно одредбите од Законот за заштита на лични податоци и не се отстапуваат на трети страни. 

Од информациите кои ни се потребни при регистрацијата и/или контакт формата ги издвојуваме:
- име и презиме
- e-mail адреса
- телефонски број

Податоците кои ги собираме и се чуваат кај нас, нема да се објавуваат, продаваат или доставуваат на трета страна освен на надлежните органи на начин определен со законските прописи на Република Северна Македонија. Друштво за производство,трговија и услуги ${companyName} со седиште: ${companyAddress} и Е.М.Б.С ,${registryNumber} Е.Д.Б ${taxNumber} го задржува правото да ги користи IP aдресите и другите податоци на корисниците за откривање на нивниот идентитет во случај на спроведување на законот и законските постапки. 

Во секој момент може да извршите промена, ажурирање или корекција на Вашите неточни лични податоци и информации.

${companyName} има усвоена политика за сигурност и заштита на податоци, со што ја демонстрира посветеноста на нашата фирма кон заштитата на приватноста на клиентите. Со исклучок на податоците од финансиска природа, сите информации кои ги собираме од веб страната се исклучиво за наша употреба (релација со корисници, контакт информации, итн.) и истите не се предаваат на други лица за било каков основ. Не собираме никакви информации од финансиска природа, како број на картичка и сл. Податоците околу кредитната картичка и банкарската сметка ќе бидат чувани и користени исклучиво од страна на банката со цел наплата на продуктите/нарачките преку извршување на  трансакција. Трансакцијата при наплаќање на производот е пренасочена и се процесира преку порталот за наплата од кредитни картички на банката. Порталот користи современа заштита на податоците и сите процеси се одвиваат преку сигурна конекција со банката.

Малолетни лица не смеат да даваат лични податоци без одобрение од нивните родители или старатели и се обврзуваме дека нема намерно да собираме или користиме податоци од малолетни лица. Ги превземаме сите заштитни мерки за заштита на личните податоци на купувачите со цел да се минимизира ризикот од неовластен пристап и злоупотреба на истите. 

Оваа политика на приватност стапува на сила од Август 2020 година. Промените во политиката на приватност ќе бидат јавно објавени на интернет странатa на ${slug}.la.mk, ${
    customDomain ?? ''
  } најмалку 10 дена пред да стапат во сила.

- Заштита на лични податоци 
- Барање за доставување на информации за обработка на личните податоци 
- Барање за дополнување, измена или бришење на податоците 
- Барање за запирање на обработката на личните податоци
`.trim();
};

const PrivacyPage = () => {
  const { t } = useTranslation();
  const title = t('pages.privacy');

  const privacyPolicy = getPrivacyPolicy({
    customDomain: 'la.mk',
    slug: '*',
    companyName: 'Техон Ко Дооел',
    registryNumber: '7442556',
    taxNumber: '4002020560697',
    companyAddress: 'Пожаревачка 88, Битола',
  });

  return (
    <>
      <Head
        siteName={'la.mk'}
        title={title}
        description={privacyPolicy.split('\n')[0]}
      />
      <Legal title={title} content={privacyPolicy} />
    </>
  );
};

export default PrivacyPage;
